# Tratando NaN

In [4]:
import pandas as pd
import numpy as np
from os import getcwd

In [5]:
file=getcwd()+'\\'+input()
ufo=pd.read_csv(file)
ufo.head()

ufo.csv

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo.columns=ufo.columns.str.replace(' ','_').str.lower()
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo.shape_reported=ufo.shape_reported.str.capitalize()
ufo.colors_reported=ufo.colors_reported.str.capitalize()
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       Triangle    NY   6/1/1930 22:00
1           Willingboro             NaN          Other    NJ  6/30/1930 20:00
2               Holyoke             NaN           Oval    CO  2/15/1931 14:00
3               Abilene             NaN           Disk    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          Light    NY  4/18/1933 19:00

In [8]:
ufo.dtypes

city               object
colors_reported    object
shape_reported     object
state              object
time               object
dtype: object

In [9]:
ufo.count()

city               18216
colors_reported     2882
shape_reported     15597
state              18241
time               18241
dtype: int64

In [10]:
data=[data[0] for data in [full_data.split() for full_data in ufo.time]]
time=[time[1] for time in [full_data.split() for full_data in ufo.time]]
ufo.drop(['time'],axis=1)
ufo.time=pd.Series(time)
ufo.head()

                   city colors_reported shape_reported state   time
0                Ithaca             NaN       Triangle    NY  22:00
1           Willingboro             NaN          Other    NJ  20:00
2               Holyoke             NaN           Oval    CO  14:00
3               Abilene             NaN           Disk    KS  13:00
4  New York Worlds Fair             NaN          Light    NY  19:00

In [11]:
#Inserindo uma coluna nova
ufo.insert(5,'data',data)
ufo.head()

                   city colors_reported shape_reported state   time       data
0                Ithaca             NaN       Triangle    NY  22:00   6/1/1930
1           Willingboro             NaN          Other    NJ  20:00  6/30/1930
2               Holyoke             NaN           Oval    CO  14:00  2/15/1931
3               Abilene             NaN           Disk    KS  13:00   6/1/1931
4  New York Worlds Fair             NaN          Light    NY  19:00  4/18/1933

In [12]:
#Retirando qualquer valor nulo da coluna shape_reported
ufo.dropna(subset=['shape_reported'],how='any').head()

                   city colors_reported shape_reported state   time       data
0                Ithaca             NaN       Triangle    NY  22:00   6/1/1930
1           Willingboro             NaN          Other    NJ  20:00  6/30/1930
2               Holyoke             NaN           Oval    CO  14:00  2/15/1931
3               Abilene             NaN           Disk    KS  13:00   6/1/1931
4  New York Worlds Fair             NaN          Light    NY  19:00  4/18/1933

In [13]:
#Contando quantos valores n√£o nulos existem em determinada coluna e separando por quantidades
#Caso queira os valores nulos apenas coloque dropna=false dentro do parenteses
ufo.shape_reported.value_counts()

Light        2803
Disk         2122
Triangle     1889
Other        1402
Circle       1365
Sphere       1054
Fireball     1039
Oval          845
Cigar         617
Formation     434
Various       333
Rectangle     303
Cylinder      294
Chevron       248
Diamond       234
Egg           197
Flash         188
Teardrop      119
Cone           60
Cross          36
Delta           7
Crescent        2
Round           2
Dome            1
Pyramid         1
Hexagon         1
Flare           1
Name: shape_reported, dtype: int64

In [14]:
#Preenchendo os valores nulos
#Caso queira em pocentagem digite normalize=True dentro de value_counts()
ufo.shape_reported.fillna(value='Unrecognizable',inplace=True)
ufo.shape_reported.value_counts()

Light             2803
Unrecognizable    2644
Disk              2122
Triangle          1889
Other             1402
Circle            1365
Sphere            1054
Fireball          1039
Oval               845
Cigar              617
Formation          434
Various            333
Rectangle          303
Cylinder           294
Chevron            248
Diamond            234
Egg                197
Flash              188
Teardrop           119
Cone                60
Cross               36
Delta                7
Crescent             2
Round                2
Pyramid              1
Hexagon              1
Flare                1
Dome                 1
Name: shape_reported, dtype: int64

In [17]:
#Preenchendo os valores nulos
#Caso queira em pocentagem digite normalize=True dentro de value_counts()
ufo.colors_reported.fillna(value='Unrecognizable',inplace=True)
ufo.colors_reported.value_counts()

Unrecognizable            15359
Red                         780
Green                       531
Orange                      528
Blue                        450
Yellow                      169
Red green                    89
Red blue                     78
Red orange                   44
Green blue                   34
Red green blue               33
Orange yellow                26
Red yellow                   25
Orange green                 23
Yellow green                 17
Orange blue                  10
Red yellow green              9
Yellow blue                   6
Orange green blue             5
Yellow green blue             5
Red yellow green blue         4
Red orange yellow             4
Red yellow blue               3
Red orange green              3
Red orange blue               3
Orange yellow green           1
Orange yellow blue            1
Red orange yellow blue        1
Name: colors_reported, dtype: int64